
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	ЗначениеПоУмолчаниюНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ЗначениеПоУмолчаниюНаСервере()
	
	ТаблицаПоумолчанию = ТаблицаЗначенийПоУмолчанию();
	
	
	Выборка = Справочники.ОписаниеСтруктурыКонфигурации.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Выборка.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Ложь);
		
	КонецЦикла;	
	
	
	Для Каждого СтркоаТаблицы из ТаблицаПоумолчанию Цикл
		
		СуществующийЭлемет = Справочники.ОписаниеСтруктурыКонфигурации.НайтиПоКоду(СтркоаТаблицы.Код);
		Если не ЗначениеЗаполнено(СуществующийЭлемет) Тогда 
			РедактируемыйОбъект = Справочники.ОписаниеСтруктурыКонфигурации.СоздатьЭлемент();
		Иначе 
			РедактируемыйОбъект = СуществующийЭлемет.ПолучитьОбъект();
		КонецЕсли;	
		
		ЗаполнитьЗначенияСвойств(РедактируемыйОбъект, СтркоаТаблицы);
		РедактируемыйОбъект.ПометкаУдаления = Ложь;
		
		если ЗначениеЗаполнено(СтркоаТаблицы.Родитель) Тогда 
			РедактируемыйОбъект.Родитель = Справочники.ОписаниеСтруктурыКонфигурации.НайтиПоКоду(СтркоаТаблицы.Родитель);
		КонецЕсли;
		
		РедактируемыйОбъект.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры	

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Значения по умолчанию

&НаСервере
Функция ТаблицаЗначенийПоУмолчанию()
	
	ЗначенияПоУмолчанию = Новый ТаблицаЗначений;
	ЗначенияПоУмолчанию.Колонки.Добавить("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипЭлементаСтруктуры"));
	ЗначенияПоУмолчанию.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная)));
	ЗначенияПоУмолчанию.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	ЗначенияПоУмолчанию.Колонки.Добавить("ПривычнаяСортировка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ЗначенияПоУмолчанию.Колонки.Добавить("Родитель", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(256, ДопустимаяДлина.Переменная)));
	ЗначенияПоУмолчанию.Колонки.Добавить("ПринимаемыйТип",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная)));
	
	ДобавитьОбщие(ЗначенияПоУмолчанию);
	ДобавитьКонстанты(ЗначенияПоУмолчанию);
	ДобавитьСправочники(ЗначенияПоУмолчанию);
	ДобавитьДокументы(ЗначенияПоУмолчанию);
	ДобавитьЖурналыДокументов(ЗначенияПоУмолчанию);
	ДобавитьПеречисления(ЗначенияПоУмолчанию);
	ДобавитьОтчеты(ЗначенияПоУмолчанию);
	ДобавитьОбработки(ЗначенияПоУмолчанию);
	ДобавитьПланыВидовХарактеристик(ЗначенияПоУмолчанию);
	ДобавитьПланыСчетов(ЗначенияПоУмолчанию);
	ДобавитьПланыВидовРасчета(ЗначенияПоУмолчанию);
	ДобавитьРегистрыСведений(ЗначенияПоУмолчанию);
	ДобавитьРегистрыНакопления(ЗначенияПоУмолчанию);
	ДобавитьРегистрыБухгалтерии(ЗначенияПоУмолчанию);
	ДобавитьРегистрыРасчета(ЗначенияПоУмолчанию);
	ДобавитьБизнесПроцессы(ЗначенияПоУмолчанию);
	ДобавитьЗадачи(ЗначенияПоУмолчанию);
	ДобавитьВнешниеИсточникиДанных(ЗначенияПоУмолчанию);
	
	Возврат ЗначенияПоУмолчанию;
	
КонецФункции

&НаСервере
Процедура ДобавитьОбщие(ЗначенияПоУмолчанию)
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Общие";
	НоваяСтрока.Наименование = "Общие";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - Подсистемы
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Подсистемы";
	НоваяСтрока.Наименование = "Подсистемы";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыПодсистемы";
	НоваяСтрока.Наименование = "Элементы Подсистемы";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Подсистемы";
	НоваяСтрока.ПринимаемыйТип = "Subsystem";
	
	//Общие - Подсистемы
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ОбщиеМодули
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ОбщиеМодули";
	НоваяСтрока.Наименование = "Общие модули";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыОбщиеМодули";
	НоваяСтрока.Наименование = "Элементы Общие модули";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбщиеМодули";
	НоваяСтрока.ПринимаемыйТип = "CommonModule";
	
	//Общие - ОбщиеМодули
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ПараметрыСеанса
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ПараметрыСеанса";
	НоваяСтрока.Наименование = "Параметры сеанса";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыПараметрыСеанса";
	НоваяСтрока.Наименование = "Элементы Параметры сеанса";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПараметрыСеанса";
	НоваяСтрока.ПринимаемыйТип = "SessionParameter";
	
	//Общие - ПараметрыСеанса
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - Роли
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Роли";
	НоваяСтрока.Наименование = "Роли";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыРоли";
	НоваяСтрока.Наименование = "Элементы Роли";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Роли";
	НоваяСтрока.ПринимаемыйТип = "Role";
	
	//Общие - Роли
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ОбщиеРеквизиты
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ОбщиеРеквизиты";
	НоваяСтрока.Наименование = "Общие реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 5;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыОбщиеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Общие реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбщиеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "CommonAttribute";
	
	//Общие - ОбщиеРеквизиты
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ПланыОбмена
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ПланыОбмена";
	НоваяСтрока.Наименование = "Планы обмена";
	НоваяСтрока.ПривычнаяСортировка = 6;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыПланыОбмена";
	НоваяСтрока.Наименование = "Элементы Планы обмена";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыОбмена";
	НоваяСтрока.ПринимаемыйТип = "ExchangePlan";
	
	//Общие - ПланыОбмена
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - КритерииОтбора
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "КритерииОтбора";
	НоваяСтрока.Наименование = "Критерии отбора";
	НоваяСтрока.ПривычнаяСортировка = 7;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыКритерииОтбора";
	НоваяСтрока.Наименование = "Элементы Критерии отбора";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "КритерииОтбора";
	НоваяСтрока.ПринимаемыйТип = "FilterCriterion";
	
	//Общие - КритерииОтбора
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ПодпискиНаСобытия
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ПодпискиНаСобытия";
	НоваяСтрока.Наименование = "Подписки на события";
	НоваяСтрока.ПривычнаяСортировка = 8;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыПодпискиНаСобытия";
	НоваяСтрока.Наименование = "Элементы Подписки на события";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПодпискиНаСобытия";
	НоваяСтрока.ПринимаемыйТип = "EventSubscription";
	
	//Общие - ПодпискиНаСобытия
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - РегламентныеЗадания
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "РегламентныеЗадания";
	НоваяСтрока.Наименование = "Регламентные задания";
	НоваяСтрока.ПривычнаяСортировка = 9;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыРегламентныеЗадания";
	НоваяСтрока.Наименование = "Элементы Регламентные задания";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегламентныеЗадания";
	НоваяСтрока.ПринимаемыйТип = "ScheduledJob";
	
	//Общие - РегламентныеЗадания
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ФункциональныеОпции
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ФункциональныеОпции";
	НоваяСтрока.Наименование = "Функциональные опции";
	НоваяСтрока.ПривычнаяСортировка = 10;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыФункциональныеОпции";
	НоваяСтрока.Наименование = "Элементы Функциональные опции";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ФункциональныеОпции";
	НоваяСтрока.ПринимаемыйТип = "FunctionalOption";
	
	//Общие - ФункциональныеОпции
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ПараметрыФункциональныхОпций
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ПараметрыФункциональныхОпций";
	НоваяСтрока.Наименование = "Параметры функциональных опций";
	НоваяСтрока.ПривычнаяСортировка = 11;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыПараметрыФункциональныхОпций";
	НоваяСтрока.Наименование = "Элементы Параметры функциональных опций";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПараметрыФункциональныхОпций";
	НоваяСтрока.ПринимаемыйТип = "FunctionalOptionsParameter";
	
	//Общие - ПараметрыФункциональныхОпций
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ОпределяемыеТипы
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ОпределяемыеТипы";
	НоваяСтрока.Наименование = "Определяемые типы";
	НоваяСтрока.ПривычнаяСортировка = 12;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыОпределяемыеТипы";
	НоваяСтрока.Наименование = "Элементы Определяемые типы";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОпределяемыеТипы";
	НоваяСтрока.ПринимаемыйТип = "DefinedType";
	
	//Общие - ОпределяемыеТипы
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ХранилищаНастроек
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ХранилищаНастроек";
	НоваяСтрока.Наименование = "Хранилища настроек";
	НоваяСтрока.ПривычнаяСортировка = 13;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыХранилищаНастроек";
	НоваяСтрока.Наименование = "Элементы Хранилища настроек";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ХранилищаНастроек";
	НоваяСтрока.ПринимаемыйТип = "SettingsStorage";
	
	//Общие - ХранилищаНастроек
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ОбщиеФормы
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ОбщиеФормы";
	НоваяСтрока.Наименование = "Общие формы";
	НоваяСтрока.ПривычнаяСортировка = 14;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыОбщиеФормы";
	НоваяСтрока.Наименование = "Элементы Общие формы";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбщиеФормы";
	НоваяСтрока.ПринимаемыйТип = "CommonForm";
	
	//Общие - ОбщиеФормы
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ОбщиеКоманды
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ОбщиеКоманды";
	НоваяСтрока.Наименование = "Общие команды";
	НоваяСтрока.ПривычнаяСортировка = 15;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыОбщиеКоманды";
	НоваяСтрока.Наименование = "Элементы Общие команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбщиеКоманды";
	НоваяСтрока.ПринимаемыйТип = "CommonCommand";
	
	//Общие - ОбщиеКоманды
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ГруппыКоманд
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ГруппыКоманд";
	НоваяСтрока.Наименование = "Группы команд";
	НоваяСтрока.ПривычнаяСортировка = 16;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыГруппыКоманд";
	НоваяСтрока.Наименование = "Элементы Группы команд";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ГруппыКоманд";
	НоваяСтрока.ПринимаемыйТип = "CommandGroup";
	
	//Общие - ГруппыКоманд
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ОбщиеМакеты
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ОбщиеМакеты";
	НоваяСтрока.Наименование = "Общие макеты";
	НоваяСтрока.ПривычнаяСортировка = 17;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыОбщиеМакеты";
	НоваяСтрока.Наименование = "Элементы Общие макеты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбщиеМакеты";
	НоваяСтрока.ПринимаемыйТип = "CommonTemplate";
	
	//Общие - ОбщиеМакеты
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ОбщиеКартинки
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ОбщиеКартинки";
	НоваяСтрока.Наименование = "Общие картинки";
	НоваяСтрока.ПривычнаяСортировка = 18;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыОбщиеКартинки";
	НоваяСтрока.Наименование = "Элементы Общие картинки";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбщиеКартинки";
	НоваяСтрока.ПринимаемыйТип = "CommonPicture";
	
	//Общие - ОбщиеКартинки
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - XDTOПакеты
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "XDTOПакеты";
	НоваяСтрока.Наименование = "XDTO-пакеты";
	НоваяСтрока.ПривычнаяСортировка = 19;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыXDTOПакеты";
	НоваяСтрока.Наименование = "Элементы XDTO-пакеты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "XDTOПакеты";
	НоваяСтрока.ПринимаемыйТип = "XDTOPackage";
	
	//Общие - XDTOПакеты
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - WebСервисы
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "WebСервисы";
	НоваяСтрока.Наименование = "Web-сервисы";
	НоваяСтрока.ПривычнаяСортировка = 20;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыWebСервисы";
	НоваяСтрока.Наименование = "Элементы Web-сервисы";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "WebСервисы";
	НоваяСтрока.ПринимаемыйТип = "WebService";
	
	//Общие - WebСервисы
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - HTTPСервисы
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "HTTPСервисы";
	НоваяСтрока.Наименование = "HTTP-сервисы";
	НоваяСтрока.ПривычнаяСортировка = 21;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыHTTPСервисы";
	НоваяСтрока.Наименование = "Элементы HTTP-сервисы";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "HTTPСервисы";
	НоваяСтрока.ПринимаемыйТип = "HTTPService";
	
	//Общие - HTTPСервисы
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - WSСсылки
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "WSСсылки";
	НоваяСтрока.Наименование = "WS-ссылки";
	НоваяСтрока.ПривычнаяСортировка = 22;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыWSСсылки";
	НоваяСтрока.Наименование = "Элементы WS-ссылки";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "WSСсылки";
	НоваяСтрока.ПринимаемыйТип = "WSReference";
	
	//Общие - WSСсылки
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - ЭлементыСтиля
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ЭлементыСтиля";
	НоваяСтрока.Наименование = "Элементы стиля";
	НоваяСтрока.ПривычнаяСортировка = 23;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыЭлементыСтиля";
	НоваяСтрока.Наименование = "Элементы Элементы стиля";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ЭлементыСтиля";
	НоваяСтрока.ПринимаемыйТип = "StyleItem";
	
	//Общие - ЭлементыСтиля
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - Стили
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Стили";
	НоваяСтрока.Наименование = "Стили";
	НоваяСтрока.ПривычнаяСортировка = 24;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыСтили";
	НоваяСтрока.Наименование = "Элементы Стили";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Стили";
	НоваяСтрока.ПринимаемыйТип = "Style";
	
	//Общие - Стили
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общие - Языки
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Языки";
	НоваяСтрока.Наименование = "Языки";
	НоваяСтрока.ПривычнаяСортировка = 25;
	НоваяСтрока.Родитель = "Общие";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыЯзыки";
	НоваяСтрока.Наименование = "Элементы Языки";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Языки";
	НоваяСтрока.ПринимаемыйТип = "Language";
	
	//Общие - Языки
	//Общие
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////

КонецПроцедуры	

&НаСервере
Процедура ДобавитьКонстанты(ЗначенияПоУмолчанию)	
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Константы";
	НоваяСтрока.Наименование = "Константы";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыКонстанты";
	НоваяСтрока.Наименование = "Элементы константы";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Константы";
	НоваяСтрока.ПринимаемыйТип = "Constant";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьСправочники(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Справочники";
	НоваяСтрока.Наименование = "Справочники";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыСправочники";
	НоваяСтрока.Наименование = "Элементы Справочники";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Справочники";
	НоваяСтрока.ПринимаемыйТип = "Catalog";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "СправочникиСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыСправочники";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "СправочникиЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "СправочникиСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "СправочникиРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыСправочники";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "СправочникиЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "СправочникиРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "СправочникиТабличныеЧасти";
	НоваяСтрока.Наименование = "Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "ЭлементыСправочники";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "СправочникиЭлементыТабличныеЧасти";
	НоваяСтрока.Наименование = "Элементы Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "СправочникиТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSection";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	НоваяСтрока.Код = "СправочникиЭлементыТабличныеЧастиРеквизиты";
	НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "СправочникиЭлементыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "СправочникиКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыСправочники";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "СправочникиЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "СправочникиКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьДокументы(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Документы";
	НоваяСтрока.Наименование = "Документы";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыДокументы";
	НоваяСтрока.Наименование = "Элементы Документы";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Документы";
	НоваяСтрока.ПринимаемыйТип = "Document";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ДокументыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыДокументы";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ДокументыЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ДокументыСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ДокументыРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыДокументы";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ДокументыЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ДокументыРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ДокументыТабличныеЧасти";
	НоваяСтрока.Наименование = "Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "ЭлементыДокументы";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ДокументыЭлементыТабличныеЧасти";
	НоваяСтрока.Наименование = "Элементы Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ДокументыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSection";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	НоваяСтрока.Код = "ДокументыЭлементыТабличныеЧастиРеквизиты";
	НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ДокументыЭлементыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ДокументыКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыДокументы";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ДокументыЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ДокументыКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьЖурналыДокументов(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ЖурналыДокументов";
	НоваяСтрока.Наименование = "Журналы документов";
	НоваяСтрока.ПривычнаяСортировка = 5;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыЖурналыДокументов";
	НоваяСтрока.Наименование = "Элементы Журналы документов";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ЖурналыДокументов";
	НоваяСтрока.ПринимаемыйТип = "DocumentJournal";
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	//НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	//НоваяСтрока.Код = "ЖурналыДокументовСтандартныеРеквизиты";
	//НоваяСтрока.Наименование = "Стандартные реквизиты";
	//НоваяСтрока.ПривычнаяСортировка = 1;
	//НоваяСтрока.Родитель = "ЭлементыЖурналыДокументов";
	//НоваяСтрока.ПринимаемыйТип = "";
	//
	//НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	//НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	//НоваяСтрока.Код = "ЖурналыДокументовЭлементыСтандартныеРеквизиты";
	//НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	//НоваяСтрока.ПривычнаяСортировка = 0;
	//НоваяСтрока.Родитель = "ЖурналыДокументовСтандартныеРеквизиты";
	//НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	//
	//
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	//НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	//НоваяСтрока.Код = "ЖурналыДокументовРеквизиты";
	//НоваяСтрока.Наименование = "Реквизиты";
	//НоваяСтрока.ПривычнаяСортировка = 2;
	//НоваяСтрока.Родитель = "ЭлементыЖурналыДокументов";
	//НоваяСтрока.ПринимаемыйТип = "";
	//
	//НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	//НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	//НоваяСтрока.Код = "ЖурналыДокументовЭлементыРеквизиты";
	//НоваяСтрока.Наименование = "Элементы Реквизиты";
	//НоваяСтрока.ПривычнаяСортировка = 0;
	//НоваяСтрока.Родитель = "ЖурналыДокументовРеквизиты";
	//НоваяСтрока.ПринимаемыйТип = "Attribute";
	//
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	//НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	//НоваяСтрока.Код = "ЖурналыДокументовТабличныеЧасти";
	//НоваяСтрока.Наименование = "Табличные части";
	//НоваяСтрока.ПривычнаяСортировка = 3;
	//НоваяСтрока.Родитель = "ЭлементыЖурналыДокументов";
	//НоваяСтрока.ПринимаемыйТип = "";
	//
	//НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	//НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	//НоваяСтрока.Код = "ЖурналыДокументовЭлементыТабличныеЧасти";
	//НоваяСтрока.Наименование = "Элементы Табличные части";
	//НоваяСтрока.ПривычнаяСортировка = 0;
	//НоваяСтрока.Родитель = "ЖурналыДокументовТабличныеЧасти";
	//НоваяСтрока.ПринимаемыйТип = "TabularSection";
	//
	//НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	//НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	//НоваяСтрока.Код = "ЖурналыДокументовЭлементыТабличныеЧастиРеквизиты";
	//НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	//НоваяСтрока.ПривычнаяСортировка = 0;
	//НоваяСтрока.Родитель = "ЖурналыДокументовЭлементыТабличныеЧасти";
	//НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	//
	//
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	//НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	//НоваяСтрока.Код = "ЖурналыДокументовКоманды";
	//НоваяСтрока.Наименование = "Команды";
	//НоваяСтрока.ПривычнаяСортировка = 4;
	//НоваяСтрока.Родитель = "ЭлементыЖурналыДокументов";
	//НоваяСтрока.ПринимаемыйТип = "";
	//
	//НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	//НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	//НоваяСтрока.Код = "ЖурналыДокументовЭлементыКоманды";
	//НоваяСтрока.Наименование = "Элементы Команды";
	//НоваяСтрока.ПривычнаяСортировка = 0;
	//НоваяСтрока.Родитель = "ЖурналыДокументовКоманды";
	//НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьПеречисления(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Перечисления";
	НоваяСтрока.Наименование = "Перечисления";
	НоваяСтрока.ПривычнаяСортировка = 6;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыПеречисления";
	НоваяСтрока.Наименование = "Элементы Перечисления";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Перечисления";
	НоваяСтрока.ПринимаемыйТип = "Enum";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПеречисленияКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыПеречисления";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПеречисленияЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПеречисленияКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьОтчеты(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Отчеты";
	НоваяСтрока.Наименование = "Отчеты";
	НоваяСтрока.ПривычнаяСортировка = 7;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыОтчеты";
	НоваяСтрока.Наименование = "Элементы Отчеты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Отчеты";
	НоваяСтрока.ПринимаемыйТип = "Report";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ОтчетыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыОтчеты";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ОтчетыЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОтчетыСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ОтчетыРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыОтчеты";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ОтчетыЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОтчетыРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ОтчетыТабличныеЧасти";
	НоваяСтрока.Наименование = "Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "ЭлементыОтчеты";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ОтчетыЭлементыТабличныеЧасти";
	НоваяСтрока.Наименование = "Элементы Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОтчетыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSection";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	НоваяСтрока.Код = "ОтчетыЭлементыТабличныеЧастиРеквизиты";
	НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОтчетыЭлементыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ОтчетыКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыОтчеты";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ОтчетыЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОтчетыКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьОбработки(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Обработки";
	НоваяСтрока.Наименование = "Обработки";
	НоваяСтрока.ПривычнаяСортировка = 8;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыОбработки";
	НоваяСтрока.Наименование = "Элементы Обработки";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Обработки";
	НоваяСтрока.ПринимаемыйТип = "DataProcessor";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ОбработкиСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыОбработки";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ОбработкиЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбработкиСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ОбработкиРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыОбработки";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ОбработкиЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбработкиРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ОбработкиТабличныеЧасти";
	НоваяСтрока.Наименование = "Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "ЭлементыОбработки";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ОбработкиЭлементыТабличныеЧасти";
	НоваяСтрока.Наименование = "Элементы Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбработкиТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSection";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	НоваяСтрока.Код = "ОбработкиЭлементыТабличныеЧастиРеквизиты";
	НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбработкиЭлементыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ОбработкиКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыОбработки";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ОбработкиЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ОбработкиКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьПланыВидовХарактеристик(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ПланыВидовХарактеристик";
	НоваяСтрока.Наименование = "Планы видов характеристик";
	НоваяСтрока.ПривычнаяСортировка = 9;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыПланыВидовХарактеристик";
	НоваяСтрока.Наименование = "Элементы Планы видов характеристик";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовХарактеристик";
	НоваяСтрока.ПринимаемыйТип = "ChartOfCharacteristicTypes";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыВидовХарактеристикСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыПланыВидовХарактеристик";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыВидовХарактеристикЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовХарактеристикСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыВидовХарактеристикРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыПланыВидовХарактеристик";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыВидовХарактеристикЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовХарактеристикРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыВидовХарактеристикТабличныеЧасти";
	НоваяСтрока.Наименование = "Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "ЭлементыПланыВидовХарактеристик";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыВидовХарактеристикЭлементыТабличныеЧасти";
	НоваяСтрока.Наименование = "Элементы Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовХарактеристикТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSection";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	НоваяСтрока.Код = "ПланыВидовХарактеристикЭлементыТабличныеЧастиРеквизиты";
	НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовХарактеристикЭлементыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыВидовХарактеристикКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыПланыВидовХарактеристик";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыВидовХарактеристикЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовХарактеристикКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьПланыСчетов(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ПланыСчетов";
	НоваяСтрока.Наименование = "Планы счетов";
	НоваяСтрока.ПривычнаяСортировка = 10;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыПланыСчетов";
	НоваяСтрока.Наименование = "Элементы Планы счетов";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыСчетов";
	НоваяСтрока.ПринимаемыйТип = "ChartOfAccounts";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыСчетовСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыПланыСчетов";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыСчетовЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыСчетовСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыСчетовРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыПланыСчетов";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыСчетовЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыСчетовРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыСчетовТабличныеЧасти";
	НоваяСтрока.Наименование = "Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "ЭлементыПланыСчетов";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыСчетовЭлементыТабличныеЧасти";
	НоваяСтрока.Наименование = "Элементы Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыСчетовТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSection";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	НоваяСтрока.Код = "ПланыСчетовЭлементыТабличныеЧастиРеквизиты";
	НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыСчетовЭлементыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыСчетовКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыПланыСчетов";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыСчетовЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыСчетовКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьПланыВидовРасчета(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ПланыВидовРасчета";
	НоваяСтрока.Наименование = "Планы видов расчета";
	НоваяСтрока.ПривычнаяСортировка = 11;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыПланыВидовРасчета";
	НоваяСтрока.Наименование = "Элементы Планы видов расчета";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовРасчета";
	НоваяСтрока.ПринимаемыйТип = "ChartOfCalculationTypes";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыВидовРасчетаСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыПланыВидовРасчета";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыВидовРасчетаЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовРасчетаСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыВидовРасчетаРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыПланыВидовРасчета";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыВидовРасчетаЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовРасчетаРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыВидовРасчетаТабличныеЧасти";
	НоваяСтрока.Наименование = "Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "ЭлементыПланыВидовРасчета";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыВидовРасчетаЭлементыТабличныеЧасти";
	НоваяСтрока.Наименование = "Элементы Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовРасчетаТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSection";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	НоваяСтрока.Код = "ПланыВидовРасчетаЭлементыТабличныеЧастиРеквизиты";
	НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовРасчетаЭлементыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ПланыВидовРасчетаКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыПланыВидовРасчета";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ПланыВидовРасчетаЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ПланыВидовРасчетаКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьРегистрыСведений(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "РегистрыСведений";
	НоваяСтрока.Наименование = "Регистры сведений";
	НоваяСтрока.ПривычнаяСортировка = 12;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыРегистрыСведений";
	НоваяСтрока.Наименование = "Элементы Регистры сведений";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыСведений";
	НоваяСтрока.ПринимаемыйТип = "InformationRegister";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыСведенийСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыРегистрыСведений";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыСведенийЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыСведенийСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыСведенийРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыРегистрыСведений";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыСведенийЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыСведенийРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыСведенийКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыРегистрыСведений";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыСведенийЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыСведенийКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьРегистрыНакопления(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "РегистрыНакопления";
	НоваяСтрока.Наименование = "Регистры накопления";
	НоваяСтрока.ПривычнаяСортировка = 13;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыРегистрыНакопления";
	НоваяСтрока.Наименование = "Элементы Регистры накопления";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыНакопления";
	НоваяСтрока.ПринимаемыйТип = "AccumulationRegister";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыНакопленияСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыРегистрыНакопления";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыНакопленияЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыНакопленияСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыНакопленияРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыРегистрыНакопления";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыНакопленияЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыНакопленияРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыНакопленияКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыРегистрыНакопления";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыНакопленияЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыНакопленияКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьРегистрыБухгалтерии(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "РегистрыБухгалтерии";
	НоваяСтрока.Наименование = "Регистры бухгалтерии";
	НоваяСтрока.ПривычнаяСортировка = 14;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыРегистрыБухгалтерии";
	НоваяСтрока.Наименование = "Элементы Регистры бухгалтерии";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыБухгалтерии";
	НоваяСтрока.ПринимаемыйТип = "AccountingRegister";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыБухгалтерииСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыРегистрыБухгалтерии";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыБухгалтерииЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыБухгалтерииСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыБухгалтерииРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыРегистрыБухгалтерии";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыБухгалтерииЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыБухгалтерииРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыБухгалтерииКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыРегистрыБухгалтерии";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыБухгалтерииЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыБухгалтерииКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьРегистрыРасчета(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "РегистрыРасчета";
	НоваяСтрока.Наименование = "Регистры расчета";
	НоваяСтрока.ПривычнаяСортировка = 15;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыРегистрыРасчета";
	НоваяСтрока.Наименование = "Элементы Регистры расчета";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыРасчета";
	НоваяСтрока.ПринимаемыйТип = "CalculationRegister";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыРасчетаСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыРегистрыРасчета";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыРасчетаЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыРасчетаСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыРасчетаРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыРегистрыРасчета";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыРасчетаЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыРасчетаРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "РегистрыРасчетаКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыРегистрыРасчета";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "РегистрыРасчетаЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "РегистрыРасчетаКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьБизнесПроцессы(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "БизнесПроцессы";
	НоваяСтрока.Наименование = "Бизнес процессы";
	НоваяСтрока.ПривычнаяСортировка = 16;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыБизнесПроцессы";
	НоваяСтрока.Наименование = "Элементы Бизнес процессы";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "БизнесПроцессы";
	НоваяСтрока.ПринимаемыйТип = "BusinessProcess";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "БизнесПроцессыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыБизнесПроцессы";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "БизнесПроцессыЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "БизнесПроцессыСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "БизнесПроцессыРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыБизнесПроцессы";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "БизнесПроцессыЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "БизнесПроцессыРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "БизнесПроцессыТабличныеЧасти";
	НоваяСтрока.Наименование = "Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "ЭлементыБизнесПроцессы";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "БизнесПроцессыЭлементыТабличныеЧасти";
	НоваяСтрока.Наименование = "Элементы Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "БизнесПроцессыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSection";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	НоваяСтрока.Код = "БизнесПроцессыЭлементыТабличныеЧастиРеквизиты";
	НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "БизнесПроцессыЭлементыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "БизнесПроцессыКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыБизнесПроцессы";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "БизнесПроцессыЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "БизнесПроцессыКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьЗадачи(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "Задачи";
	НоваяСтрока.Наименование = "Задачи";
	НоваяСтрока.ПривычнаяСортировка = 17;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыЗадачи";
	НоваяСтрока.Наименование = "Элементы Задачи";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "Задачи";
	НоваяСтрока.ПринимаемыйТип = "Task";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ЗадачиСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыЗадачи";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ЗадачиЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ЗадачиСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ЗадачиРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыЗадачи";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ЗадачиЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ЗадачиРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ЗадачиТабличныеЧасти";
	НоваяСтрока.Наименование = "Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "ЭлементыЗадачи";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ЗадачиЭлементыТабличныеЧасти";
	НоваяСтрока.Наименование = "Элементы Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ЗадачиТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSection";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	НоваяСтрока.Код = "ЗадачиЭлементыТабличныеЧастиРеквизиты";
	НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ЗадачиЭлементыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ЗадачиКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыЗадачи";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ЗадачиЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ЗадачиКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	

&НаСервере
Процедура ДобавитьВнешниеИсточникиДанных(ЗначенияПоУмолчанию)
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыКорня");
	НоваяСтрока.Код = "ВнешниеИсточникиДанных";
	НоваяСтрока.Наименование = "Внешние источники данных";
	НоваяСтрока.ПривычнаяСортировка = 18;
	НоваяСтрока.Родитель = "";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементКорня");
	НоваяСтрока.Код = "ЭлементыВнешниеИсточникиДанных";
	НоваяСтрока.Наименование = "Элементы Внешние источники данных";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ВнешниеИсточникиДанных";
	НоваяСтрока.ПринимаемыйТип = "ExternalDataSource";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ВнешниеИсточникиДанныхСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 1;
	НоваяСтрока.Родитель = "ЭлементыВнешниеИсточникиДанных";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ВнешниеИсточникиДанныхЭлементыСтандартныеРеквизиты";
	НоваяСтрока.Наименование = "Элементы Стандартные реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ВнешниеИсточникиДанныхСтандартныеРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "StandardAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ВнешниеИсточникиДанныхРеквизиты";
	НоваяСтрока.Наименование = "Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 2;
	НоваяСтрока.Родитель = "ЭлементыВнешниеИсточникиДанных";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ВнешниеИсточникиДанныхЭлементыРеквизиты";
	НоваяСтрока.Наименование = "Элементы Реквизиты";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ВнешниеИсточникиДанныхРеквизиты";
	НоваяСтрока.ПринимаемыйТип = "Attribute";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ВнешниеИсточникиДанныхТабличныеЧасти";
	НоваяСтрока.Наименование = "Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 3;
	НоваяСтрока.Родитель = "ЭлементыВнешниеИсточникиДанных";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ВнешниеИсточникиДанныхЭлементыТабличныеЧасти";
	НоваяСтрока.Наименование = "Элементы Табличные части";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ВнешниеИсточникиДанныхТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSection";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементДочернихОбъектов");
	НоваяСтрока.Код = "ВнешниеИсточникиДанныхЭлементыТабличныеЧастиРеквизиты";
	НоваяСтрока.Наименование = "Элементы реквизиты табличных частей";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ВнешниеИсточникиДанныхЭлементыТабличныеЧасти";
	НоваяСтрока.ПринимаемыйТип = "TabularSectionAttribute";
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.СлужебныеЭлементыОбъекта");
	НоваяСтрока.Код = "ВнешниеИсточникиДанныхКоманды";
	НоваяСтрока.Наименование = "Команды";
	НоваяСтрока.ПривычнаяСортировка = 4;
	НоваяСтрока.Родитель = "ЭлементыВнешниеИсточникиДанных";
	НоваяСтрока.ПринимаемыйТип = "";
	
	НоваяСтрока = ЗначенияПоУмолчанию.Добавить();
	НоваяСтрока.Тип = ПредопределенноеЗначение("Перечисление.ТипЭлементаСтруктуры.ЗагружаемыйЭлементОбъекта");
	НоваяСтрока.Код = "ВнешниеИсточникиДанныхЭлементыКоманды";
	НоваяСтрока.Наименование = "Элементы Команды";
	НоваяСтрока.ПривычнаяСортировка = 0;
	НоваяСтрока.Родитель = "ВнешниеИсточникиДанныхКоманды";
	НоваяСтрока.ПринимаемыйТип = "Command";

КонецПроцедуры	
