
&НаСервереБезКонтекста
Процедура ОчиститьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МетаданныеКонфигруации.Ссылка
	|ИЗ
	|	Справочник.МетаданныеКонфигруации КАК МетаданныеКонфигруации";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы из ТаблицаРезультат Цикл 
		
		Объект = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры
